## Pandas Groupby

In [1]:
import numpy as np
import pandas as pd

In [7]:
data = {'Team':['KKR','CSK','RCB','RCB','KKR','CSK'],
        'Player':['Russell','Dhoni','ABD','Kohli','DK','Raina'],
        'Run':[100,67,98,85,80,56]}

In [8]:
df = pd.DataFrame(data)
df

  Team   Player  Run
0  KKR  Russell  100
1  CSK    Dhoni   67
2  RCB      ABD   98
3  RCB    Kohli   85
4  KKR       DK   80
5  CSK    Raina   56

In [11]:
byTeam = df.groupby('Team')
byTeam

In [12]:
byTeam.mean()

       Run
Team
CSK   61.5
KKR   90.0
RCB   91.5

In [13]:
byTeam.median()

       Run
Team
CSK   61.5
KKR   90.0
RCB   91.5

In [14]:
byTeam.sum()

      Run
Team
CSK   123
KKR   180
RCB   183

In [15]:
byTeam.std()

            Run
Team
CSK    7.778175
KKR   14.142136
RCB    9.192388

In [20]:
df.groupby('Team').count()

      Player  Run
Team
CSK        2    2
KKR        2    2
RCB        2    2

In [21]:
df.groupby('Team').sum().loc['KKR']

Run    180
Name: KKR, dtype: int64

In [23]:
df.groupby('Team').max()

       Player  Run
Team
CSK     Raina   67
KKR   Russell  100
RCB     Kohli   98

In [24]:
df.groupby('Run').count()

     Team  Player
Run
56      1       1
67      1       1
80      1       1
85      1       1
98      1       1
100     1       1

#### Groupby method in row wise

In [25]:
df.groupby('Team').describe()

       Run
     count  mean        std   min    25%   50%    75%    max
Team
CSK    2.0  61.5   7.778175  56.0  58.75  61.5  64.25   67.0
KKR    2.0  90.0  14.142136  80.0  85.00  90.0  95.00  100.0
RCB    2.0  91.5   9.192388  85.0  88.25  91.5  94.75   98.0

#### Groupby method description in column wise

In [27]:
df.groupby('Team').describe().transpose()

Team             CSK         KKR        RCB
Run count   2.000000    2.000000   2.000000
    mean   61.500000   90.000000  91.500000
    std     7.778175   14.142136   9.192388
    min    56.000000   80.000000  85.000000
    25%    58.750000   85.000000  88.250000
    50%    61.500000   90.000000  91.500000
    75%    64.250000   95.000000  94.750000
    max    67.000000  100.000000  98.000000

####  Specified groupby description

In [28]:
df.groupby('Team').describe().transpose()['KKR']

Run  count      2.000000
     mean      90.000000
     std       14.142136
     min       80.000000
     25%       85.000000
     50%       90.000000
     75%       95.000000
     max      100.000000
Name: KKR, dtype: float64